Documents/КоммерческоеПредложение.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Document>
		<Properties>
			<Name>КоммерческоеПредложение</Name>
			<Posting>Allow</Posting>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Менеджер</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Сотрудники</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Заказчик</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>Услуги</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Дата</Name>
							<Type>
								<v8:Type>xs:dateTime</v8:Type>
								<v8:DateQualifiers>
									<v8:DateFractions>Date</v8:DateFractions>
								</v8:DateQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Услуга</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Услуги1С</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Количество</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>10</v8:Digits>
									<v8:FractionDigits>0</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ЕдиницыИзмерения</Name>
							<Type>
								<v8:Type>cfg:EnumRef.ЕдиницыИзмерения</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Цена</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Сумма</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Document>
</MetaDataObject>

Documents/КоммерческоеПредложение/Ext/ManagerModule.bsl
Процедура Печать(ТабДок, Ссылка) Экспорт
	//{{_КОНСТРУКТОР_ПЕЧАТИ(Печать)
	Макет = Документы.КоммерческоеПредложение.ПолучитьМакет("Печать");
	Запрос = Новый Запрос;
	Запрос.Текст =
	"ВЫБРАТЬ
	|	КоммерческоеПредложение.Дата,
	|	КоммерческоеПредложение.Заказчик как Заказчик,
	|	КоммерческоеПредложение.Менеджер КАК Менеджер,    
	|	КоммерческоеПредложение.Менеджер.АдресЭлектроннойПочты КАК МенеджерПочта,
	|	КоммерческоеПредложение.Менеджер.Наименование КАК МенеджерФИО,   
	|	КоммерческоеПредложение.Менеджер.Телефон КАК МенеджерТелефон,
	|	КоммерческоеПредложение.Номер,
	|	КоммерческоеПредложение.Услуги.(
	|		НомерСтроки,
	|		Дата,
	|		Услуга,
	|		Количество,
	|		ЕдиницыИзмерения,
	|		Цена,
	|		Сумма
	|	)
	|ИЗ
	|	Документ.КоммерческоеПредложение КАК КоммерческоеПредложение
	|ГДЕ
	|	КоммерческоеПредложение.Ссылка В (&Ссылка)";
	Запрос.Параметры.Вставить("Ссылка", Ссылка);
	Выборка = Запрос.Выполнить().Выбрать();

	ОбластьЗаголовок = Макет.ПолучитьОбласть("Заголовок");
	Шапка = Макет.ПолучитьОбласть("Шапка");
	ОбластьУслугиШапка = Макет.ПолучитьОбласть("УслугиШапка");
	ОбластьУслуги = Макет.ПолучитьОбласть("Услуги"); 
	ОбластьКонтакты = Макет.ПолучитьОбласть("Контакты");  
	ОбластьИтоги = Макет.ПолучитьОбласть("Итоги");
	ТабДок.Очистить();

	ВставлятьРазделительСтраниц = Ложь;
	Пока Выборка.Следующий() Цикл
		Если ВставлятьРазделительСтраниц Тогда
			ТабДок.ВывестиГоризонтальныйРазделительСтраниц();
		КонецЕсли; 
		
		ОбластьКонтакты.Параметры.ФИО = Выборка.МенеджерФИО;
		ОбластьКонтакты.Параметры.Почта = Выборка.МенеджерПочта;
		ОбластьКонтакты.Параметры.Телефон =Выборка.МенеджерТелефон;
		
		ТабДок.Вывести(ОбластьКонтакты);  
	
		ОбластьЗаголовок.Параметры.Номер = Выборка.Номер;
		ОбластьЗаголовок.Параметры.Дата2 = Формат(Выборка.Дата, НСтр("ru='ДФ=''дд ММММ гггг ""г.""'''"));	
		
		ТабДок.Вывести(ОбластьЗаголовок);
		
		Шапка.Параметры.Заполнить(Выборка);
		ТабДок.Вывести(Шапка, Выборка.Уровень());

		ТабДок.Вывести(ОбластьУслугиШапка);
		ВыборкаУслуги = Выборка.Услуги.Выбрать();
		СуммаИтог = 0;
		КоличествоИтог = 0;
		Пока ВыборкаУслуги.Следующий() Цикл
			ОбластьУслуги.Параметры.Заполнить(ВыборкаУслуги);
			ТабДок.Вывести(ОбластьУслуги, ВыборкаУслуги.Уровень());
			СуммаИтог = СуммаИтог + ВыборкаУслуги.Сумма;    
			КоличествоИтог = КоличествоИтог + ВыборкаУслуги.Количество;
			
		КонецЦикла;
        // Область итоги
		ОбластьИтоги.Параметры.ИтоговаяСумма = СуммаИтог;
		ОбластьИтоги.Параметры.Сумма = СуммаИтог;
		ОбластьИтоги.Параметры.Количество = КоличествоИтог;        
		ОбластьИтоги.Параметры.СуммаПрописью = ЧислоПрописью(СуммаИтог, ,"рубль, рубля, рублей, м, копейка, копейки, копеек, ж");
		
		Табдок.Вывести(ОбластьИтоги);
		
		ВставлятьРазделительСтраниц = Истина;
	КонецЦикла;
КонецПроцедуры
